dev-scripts/verify_kv_queue_size/throttle_on_data/rbd_plot_qd_2019-10-29/fio_exp_qd8_2019-10-29/dump-fio-bench-8-1
fio-write: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=rbd, iodepth=8
fio-3.16-28-gc656
Starting 1 process

fio-write: (groupid=0, jobs=1): err= 0: pid=5316: Tue Oct 29 08:44:22 2019
  write: IOPS=30, BW=3850KiB/s (3942kB/s)(470MiB/124985msec); 0 zone resets
    slat (usec): min=45, max=556, avg=107.54, stdev=26.63
    clat (msec): min=16, max=5523, avg=264.15, stdev=354.19
     lat (msec): min=16, max=5524, avg=264.26, stdev=354.19
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   44], 10.00th=[   61], 20.00th=[   90],
     | 30.00th=[  125], 40.00th=[  178], 50.00th=[  213], 60.00th=[  241],
     | 70.00th=[  271], 80.00th=[  355], 90.00th=[  498], 95.00th=[  617],
     | 99.00th=[ 1020], 99.50th=[ 3540], 99.90th=[ 5269], 99.95th=[ 5470],
     | 99.99th=[ 5537]
   bw (  KiB/s): min=  256, max= 6912, per=100.00%, avg=4087.20, stdev=1586.73, samples=235
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=3759
  lat (msec)   : 20=0.11%, 50=6.44%, 100=16.73%, 250=40.65%, 500=26.34%
  lat (msec)   : 750=7.45%, 1000=1.25%, 2000=0.43%, >=2000=0.61%
  cpu          : usr=0.39%, sys=0.07%, ctx=3929, majf=0, minf=2079
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=99.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3759,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=3850KiB/s (3942kB/s), 3850KiB/s-3850KiB/s (3942kB/s-3942kB/s), io=470MiB (493MB), run=124985-124985msec

Disk stats (read/write):
  sdc: ios=125/14454, merge=0/97037, ticks=1208/707096, in_queue=708300, util=92.64%